# Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов. Гарантируется, что в строке не встречается несколько пробелов подряд.
# Формат ввода
#
# Вводится строка.
# Формат вывода
#
# Выведите ответ на задачу.

print(len(input().split(" ")))
